#2) for ციკლის საშვალებით გამოთვალეთ რიცხვების ჯამი 20-იდან 40-მდე

sum = 0
for i in range(20, 40):
    sum += i
    print(sum)

#3) for ციკლის საშვალებით გამოთვალეთ 10-იდან 50-ის ჩათვლით ყველა რიცხვის ჯამი

sum = 0
for i in range(10, 51):
    sum += i
    print(sum)

#4) for ციკლის საშვალებით გამოთვალეთ 20-იდან 100-მდე ყველა ლუწი რიცხვის ჯამი, საბოლოოდ დაბეჭდეთ შედეგი

sum = 0
for i in range(20, 100):
    sum += 2
    print(sum)

#5) for ციკლის საშვალებით გამოთვალეთ 7-ის ფაქტორიალი. რიცხვის ფაქტორიალი არის ყველა რიცხვის ნამრავლი ამ რიცხვიდან 1-მდე

num = 1
for i in range(1, 8):
    num *= i
    print(num)

#6) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე

i = 0
while i <= 19:
    i += 1
    print(i)

#7) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 10-იდან 30-ის ჩათვლით

i = 10
while i <= 29:
    i += 1
    print(i)

#8) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 15-იდან 80-მდე

i = 15
while i <= 79:
    i += 1
    print(i)

#9) while ციკლის საშვალებით გამოიტანეთ რიცხვები 50-იდან 0-ჩათვლით

i = 50
while i >= 1:
    i -= 1
    print(i)

#10) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ის ჩათვლით

i = 0
while i <= 49:
    i += 3
    print(i)

#11) while ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 0-იდან 50-ის ჩათვლით

i = 0
while i <= 49:
    i += 2
    print(i)

#12) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 100-იდან 20-ის ჩათვლით

i = 100
while i >= 20:
    i -= 3
    print(i)

#13) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება პაროლს სანამ ის არ შემოიყვანს goabest123-ს

password = ""
pswrd = "goabest123"

while password != pswrd:
    input("Enter Password: ")


#14) Bonus
#შექმენით პროგრამა while ციკლით რომელიც მომხარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) იქამდე სანამ არ შემოიყვანს სწორად, საბოლოოდ დაუბეჭდეთ რომ გაიარა ავტორიზაცია და გამოუტანეთ თუ რამდენი ცდა დასჭირდა

correct_pin = "2025" 
tries = 0  

pin = input("enter pin: ")

while pin != correct_pin:
    tries += 1
    pin = input("wrong... enter pin again: ")

tries += 1 
print("correct")
print("tried", tries , "times")
