#2) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.
     
object = input("enter object: ")
print(type(object))
#inputs sul stringi gamoaqvs da ra azriaq ras chavwer...


#3) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი

#string
str1 = "element"
str2 = "phone"
str3 = "song"
str4 = "something"
str5 = "pensil"
#integer
int1 = 4
int2 = 5
int3 = 8
int4 = 6
int5 = 3
#float
float1 = 66.0
float2 = 98.9
float3 = 17.7
float4 = 3.14
float5 = 5.7

#4) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

name = "Nutsa"
age = 14
heigh = 172.4

print(type(name))
print(type(age))
print(type(heigh))

#მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი შეცდომების გარეშე

heigh = float(input("enter your heigh: "))
years = int(input("how many years passed?: "))
print((years*0.7) + heigh)