#შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში)

book1 = "16.99"
book2 = "14.80"
book3 = "21"
book4 = "19.99"
book5 = "17"

sale = "5"

#დაწერეთ პითონის კოდი რომელიც მომხმარებელს input-ის საშვალებით შეეკითხება და ცვლადში შეინახავს შემდეგ ინფორმაციას:
#Name
#Surname
#Age
#Location
#Hobby
#ამ ცვლადების საშვალებით კი გამოიტანს ერთ წინადადებას რომელშიც ყველა მიღებული ინფორმაცია იქნება გამოყენებული. 

Name = input("what is your name?: ")
Surname = input("what is your surmane?: ")
Age = input("how old are you?: ")
Location = input("where do you live?: ")
Hobby = input("what do you like to do?: ")

print(Name + " " + Surname + " " + "is " + Age + "." + "lives in " + Location + "." + "likes to" + " " + Hobby)

