 #2) განმარტეთ control flow, ჩამოწერეთ მისი შემადგენელი ტექნიკები, აღწერეთ თითოეული
#control flow არის კომპიუტერის დინების მართვა, იგი შედგება 3 ნაწილისგან: თანმიმდევრობა, არჩევა და განმეორება

 #3) ახსენით რა არის ალგორითმი (ტექსტურ ფაილში), ჩამოწერეთ ალგორითმის წარმოდგენის გზები და მათი თვისებები. თქვენ რომელს ანიჭებთ უპირატესობას და რატომ?
#ალგორითმი არის რთული პროცესის ნაბიჯ-ნაბიჯ გაკეთება. 

 #4) თქვენ მიერ დაწერილი კოდებიდან აარჩიეთ ერთერთი და შექმენით მისი flowchart
#მაგალითად:
#temperature = -1
#rainy = True
#false
#can_go_out = temperature >= 10 and not rainy
#print(can_go_out) 


 #5) for ციკლის საშვალებით გამოიტანეთ რიცხვები 20-მდე
for num in range(19):
    print("int")

 #6) for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით
for num in range(1,31):
    print(num)

 #7) for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე
for num in range(15,80):
    print(num)

 #8) for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 64-ის ჩათვლით
for num in range(0,65):
    print(num)

 #9) for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით
for num in range(3,51,3):
    print(num)

 #10) პროგრამას ჩადურად დაათვლევინეთ 50-ის ჩათვლით
for num in range(0,51):
    print(num)

 #11) პროგრამას გამოტანინეთ ყველა ლუწი რიცხვი 100-მდე
for num in range(2, 100, 2):
    print(num)

 #12) Bonus
#პროგრამას გამოატანინეთ რიცხვები 20-იდან 0-მდე, for ციკლით

for num in range(20,-1,-1):
    print(num)
